app/views/listings/index.html.erb

                                <div class="panel-list-img text-center">
                                    <%= image_tag listing.photos[0].image.url(:medium) if listing.photos.length > 0  %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."listing_id" = ?  [["listing_id", 4]]