app/views/conversations/index.html.erb

                    <% other = conversation.sender == current_user ? conversation.recipient : conversation.sender %>
                    <% if !conversation.messages.blank? %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  [["conversation_id", 1]]