app/views/partial/_verticalnavbar.html.erb

<script>
$(function(){

  // basicsが常に存在するので、値は5からスタート
  var notchecked = 5;

  // Modelに値が存在するならば、chekedクラスを追加して、not checked-- により、あたいをヘラす。
  <% if !@listing.listing_title.blank? && !@listing.listing_content.blank? %>
    $('#nav-description').attr('class', 'listing-checked');
    notchecked--;
  <%else%>
    $('#nav-description').attr('class', 'listing-notchecked');
  <% end %>

  <% if !@listing.address.blank? %>
    $('#nav-address').attr('class', 'listing-checked');
    notchecked--;
  <%else%>
    $('#nav-address').attr('class', 'listing-notchecked');
  <% end %>

  <% if !@listing.photos.blank? %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."listing_id" = ?  [["listing_id", 4]]