app/views/pages/index.html.erb

SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = ?  [["user_id", 5]]
---
        <% @users.each do |user|%>
          <% if !user.listings.blank?%>