app/views/reservations/reserved.html.erb

        <% @listings.each do |listing| %>
          <% listing.reservations.each do |reservation| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."listing_id" = ?  [["listing_id", 4]]