app/controllers/listings_controller.rb

  def show
    @photos = @listing.photos

    # 今のユーザーがこのリスティングを予約しているか否か
    @currentUserBooking = Reservation.where("listing_id = ? AND user_id = ?",@listing.id,current_user.id).present? if current_user

    @reviews = @listing.reviews

    @currentUserReview = @reviews.find_by(user_id:  current_user.id) if current_user
---
SELECT "photos".* FROM "photos" WHERE "photos"."listing_id" = ?  [["listing_id", 4]]
SELECT "reservations".* FROM "reservations" WHERE (listing_id = 4 AND user_id = 5)
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."listing_id" = ? AND "reviews"."user_id" = ? LIMIT 1  [["listing_id", 4], ["user_id", 5]]

  def create
    # パラメーターとともに現在のユーザーのリスティングを作成
    @listing = current_user.listings.build(listing_params)

    if @listing.save
---
INSERT INTO "listings" ("home_type", "pet_type", "breeding_years", "pet_size", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @listing.update(listing_params)
---
UPDATE "listings" SET "home_type" = ?, "pet_type" = ?, "breeding_years" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["home_type", "クロスバイク"], ["pet_type", "１６０〜１７０cm"], ["breeding_years", 3], ["updated_at", "2017-02-23 15:46:13.704194"], ["id", 7]]

  def not_checked
    @listing = Listing.find(params[:listing_id])
    @listing.update(not_checked: params[:not_checked])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "listings" SET "not_checked" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["not_checked", 1], ["updated_at", "2017-02-22 19:08:28.659761"], ["id", 4]]

  def set_listing
    @listing = Listing.find(params[:id])
---
SELECT listings.*, (69.09332411348201 * ABS(listings.latitude - 35.6641222) * 0.7071067811865475) + (59.836573914187355 * ABS(listings.longitude - 139.729426) * 0.7071067811865475) AS distance, CASE WHEN (listings.latitude >= 35.6641222 AND listings.longitude >= 139.729426) THEN  45.0 WHEN (listings.latitude <  35.6641222 AND listings.longitude >= 139.729426) THEN 135.0 WHEN (listings.latitude <  35.6641222 AND listings.longitude <  139.729426) THEN 225.0 WHEN (listings.latitude >= 35.6641222 AND listings.longitude <  139.729426) THEN 315.0 END AS bearing FROM "listings" WHERE (listings.latitude BETWEEN 35.51939041688915 AND 35.80885398311085 AND listings.longitude BETWEEN 139.5512833429498 AND 139.90756865705018 AND listings.id != 4)  ORDER BY distance ASC