app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
  def index #views/index.html.erbを表示させるというアクション
    @users = User.all

SELECT listings.*, (69.09332411348201 * ABS(listings.latitude - 33.5606173) * 0.7071067811865475) + (59.836573914187355 * ABS(listings.longitude - 133.53571710000006) * 0.7071067811865475) AS distance, CASE WHEN (listings.latitude >= 33.5606173 AND listings.longitude >= 133.53571710000006) THEN  45.0 WHEN (listings.latitude <  33.5606173 AND listings.longitude >= 133.53571710000006) THEN 135.0 WHEN (listings.latitude <  33.5606173 AND listings.longitude <  133.53571710000006) THEN 225.0 WHEN (listings.latitude >= 33.5606173 AND listings.longitude <  133.53571710000006) THEN 315.0 END AS bearing FROM "listings" WHERE "listings"."active" = ? AND (listings.latitude BETWEEN 33.54614412168891 AND 33.57509047831108 AND listings.longitude BETWEEN 133.51834862092323 AND 133.55308557907688)  ORDER BY distance  [["active", "t"]]
---
  def search
    if params[:search].present?

      session[:address] = params[:search]

      if params["lat"].present? & params["lng"].present?
        @latitude = params["lat"]
        @longitude = params["lng"]

        geolocation = [@latitude,@longitude]
      else
        geolocation = Geocoder.coordinates(params[:search])
        @latitude = geolocation[0]
        @longitude = geolocation[1]
      end

      @listings = Listing.where(active: true).near(geolocation, 1, order: 'distance')

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."listing_id" = ? AND (('2017-02-23' <= start_date AND start_date <= '2017-03-17')
---
      @listings.each do |listing|

        # check the listing is availble between start_date to end_date
        unavailable = listing.reservations.where(
            "(? <= start_date AND start_date <= ?)
              OR (? <= end_date AND end_date <= ?)
              OR (start_date < ? AND ? < end_date)",
            start_date, end_date,
            start_date, end_date,
            start_date, end_date
        ).limit(1)

SELECT listings.*, (69.09332411348201 * ABS(listings.latitude - 35.6641222) * 0.7071067811865475) + (59.836573914187355 * ABS(listings.longitude - 139.729426) * 0.7071067811865475) AS distance, CASE WHEN (listings.latitude >= 35.6641222 AND listings.longitude >= 139.729426) THEN  45.0 WHEN (listings.latitude <  35.6641222 AND listings.longitude >= 139.729426) THEN 135.0 WHEN (listings.latitude <  35.6641222 AND listings.longitude <  139.729426) THEN 225.0 WHEN (listings.latitude >= 35.6641222 AND listings.longitude <  139.729426) THEN 315.0 END AS bearing FROM "listings" WHERE "listings"."active" = ? AND (listings.latitude BETWEEN 35.649649021688916 AND 35.67859537831109 AND listings.longitude BETWEEN 139.71161173429496 AND 139.74724026570502)  ORDER BY distance  [["active", "t"]]
---
  def ajaxsearch

    # まずajaxで送られてきた緯度経度をセッションに入れる
    if !params[:geolocation].blank?
      geolocation = params[:geolocation]
    end

    # まずajaxで送られてきた緯度経度をセッションに入れる
    if !params[:location].blank?
      session[:address] = params[:location]
    end

    @listings = Listing.where(active: true).near(geolocation, 1, order: 'distance')